# GetSymDefSubType

## Description
Returns the sub type defined for a symbol definiiton. This is used when creating and using plug-in styles.

```pascal
FUNCTION GetSymDefSubType(hSymDef : HANDLE) : INTEGER;
```

```python

def vs.GetSymDefSubType(hSymDef):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSymDef|HANDLE|Handle to a symbol definition contaiing a plug-in style.|

## Version
Availability: from Vectorworks 2017
## Category
* Objects - Symbols